# Используем официальный образ Node.js версии 20.9.0
FROM node:20.9.0-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и yarn.lock, чтобы установить зависимости
COPY package.json yarn.lock ./

# Устанавливаем зависимости с использованием Yarn
RUN yarn install --frozen-lockfile

# Копируем остальной исходный код приложения
COPY . .

# Собираем приложение
RUN yarn build

# В докере наше приложение должно слушать порт 3000
EXPOSE 3001

# Команда для запуска приложения
CMD ["yarn", "start"]
